documentation/pos-tagging.org
#+TITLE: Tag-set used for POS-tagging of Danish Medieval Charters
#+AUTHOR: Sean Vrieland & Alex Speed Kjeldsen
#+EMAIL: sean.vrieland@hum.ku.dk & alex@hum.ku.dk    

* Nouns (xNC and xNP)
|------------+--------+--------+------+---------|
| Word class | Gender | Number | Case | Species |
|------------+--------+--------+------+---------|
| xNC        | gMF    | nS     | cNAD | sI      |
| xNP        | gN     | nP     | cG   | sD      |
|            | gU     | nU     | cU   | sU      |
|------------+--------+--------+------+---------|
 - xNC: Noun, common
 - xNP: Noun, proper

* Adjectives (xAJ)
|------------+-------+--------+--------+------+---------|
| Word class | Grade | Gender | Number | Case | Species |
|------------+-------+--------+--------+------+---------|
| xAJ        | rP    | gMF    | nS     | cNAD | sD      |
|            | rC    | gN     | nP     | cG   | sI      |
|            | rS    |        |        |      |         |
|            | rU    | gU     | nU     | cU   | sU      |
|------------+-------+--------+--------+------+---------|

* Numerals (xNA and xNO)
|------------+--------+--------+------+---------|
| Word class | Gender | Number | Case | Species |
|------------+--------+--------+------+---------|
| xNO        | gMF    | nS     | cNAD | sD      |
| xNA        | gN     | nP     | cG   | sI      |
| xNU        | gU     | nU     | cU   | sU      |
|------------+--------+--------+------+---------|

* Pronouns and Determiners (xPE, xPQ, xPI, xDD, xDQ, xDP)
|------------+--------+--------+--------+------|
| Word class | Person | Gender | Number | Case |
|------------+--------+--------+--------+------|
| xPE        | p1     | gM     | nS     | cN   |
|            | p2     | gF     | nP     | cAD  |
|            | p3     | gN     |        | cG   |
|------------+--------+--------+--------+------|

|------------+--------+--------+------|
| Word class | Gender | Number | Case |
|------------+--------+--------+------|
| xPQ        | gM     | nS     | cN   |
|            | gF     | nP     | cAD  |
|            | gN     |        | cG   |
|------------+--------+--------+------|

|------------+--------+--------+------|
| Word class | Gender | Number | Case |
|------------+--------+--------+------|
| xPI        | gM     | nS     | cN   |
|            | gF     | nP     | cAD  |
|            | gN     |        | cG   |
|------------+--------+--------+------|

|------------+--------+--------+------|
| Word class | Gender | Number | Case |
|------------+--------+--------+------|
| xDD        | gM     | nS     | cN   |
|            | gF     | nP     | cAD  |
|            | gN     |        | cG   |
|------------+--------+--------+------|

|------------+--------+--------+------|
| Word class | Gender | Number | Case |
|------------+--------+--------+------|
| xDQ        | gM     | nS     | cN   |
|            | gF     | nP     | cAD  |
|            | gN     |        | cG   |
|------------+--------+--------+------|

|------------+--------+--------+------|
| Word class | Gender | Number | Case |
|------------+--------+--------+------|
| xDP        | gM     | nS     | cN   |
|            | gF     | nP     | cAD  |
|            | gN     |        | cG   |
|------------+--------+--------+------|

 - xPE: Pronoun, personal
 - xPQ: Pronoun, interrogative
 - xPI: Pronoun, indefinite
 - xDD: Determiner, demonstrative
 - xDQ: Determiner, quantifier
 - xDP: Determiner, possessive

* Articles (AT)
|------------+--------+--------+------+---------|
| Word class | Gender | Number | Case | Species |
|------------+--------+--------+------+---------|
| xAT        | gMF    | nS     | cNAD | sD      |
|            | gN     | nP     | cG   | sI      |
|            | gU     | nU     | cU   | sU      |
|------------+--------+--------+------+---------|

* Verbs (xVB)
** Finite (xVB fF)
|------------+------------+-------+------+--------+-------|
| Word class | Finiteness | Tense | Mood | Number | Voice |
|------------+------------+-------+------+--------+-------|
| xVB        | fF         | tPS   | mIN  | nS     | vA    |
|            |            | tPT   | mSU  | nP     | vR    |
|            |            |       | mIP  |        |       |
|            |            | tU    | mU   | nU     | vU    |
|------------+------------+-------+------+--------+-------|
** Participles (xVB fP)
|------------+------------+-------+-------+--------+--------+------+---------|
| Word class | Finiteness | Tense | Voice | Gender | Number | Case | Species |
|------------+------------+-------+-------+--------+--------+------+---------|
| xVB        | fP         | tPS   | vA    | gMF    | nS     | cNAD | sD      |
|            |            | tPT   | vR    | gN     | nP     | cG   | sI      |
|            |            | tU    | vU    | gU     | nU     | cU   | sU      |
|------------+------------+-------+-------+--------+--------+------+---------|
** Infinitives (xVB fI)
|------------+------------+-------|
| Word class | Finiteness | Voice |
|------------+------------+-------|
| xVB        | fI         | vA    |
|            |            | vR    |
|            |            | vU    |
|------------+------------+-------|

* Adverbs (xAV)
|------------+-------|
| Word class | Grade |
|------------+-------|
| xAV        | rP    |
|            | rC    |
|            | rS    |
|            | rU    |
|------------+-------|

* Uninflected categories
 - xAP: Preposition (we do not specify what the prepositions govern)
 - xRP: Relative Particle
 - xCC: Conjunction, coordinating
 - xCS: Conjunction, subordinating
 - xIM: Infinitive marker
 - xIT: Interjection
 - xUA: Unassigned
 - xFW: Foreign word
