documentation/pos-tagging.html
<!doctype html>
<html lang="da">
<head>
<title>Tag-set used for POS-tagging of Danish Medieval Charters</title>
<!-- 2018-09-24 Mon 09:32 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Sean Vrieland &amp; Alex Speed Kjeldsen">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Tag-set used for POS-tagging of Danish Medieval Charters</h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Nouns (xNC and xNP)</h2>
<div class="outline-text-2" id="text-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
<th scope="col" class="text-left">Species</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xNC</td>
<td class="text-left">gMF</td>
<td class="text-left">nS</td>
<td class="text-left">cNAD</td>
<td class="text-left">sI</td>
</tr>

<tr>
<td class="text-left">xNP</td>
<td class="text-left">gN</td>
<td class="text-left">nP</td>
<td class="text-left">cG</td>
<td class="text-left">sD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gU</td>
<td class="text-left">nU</td>
<td class="text-left">cU</td>
<td class="text-left">sU</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>xNC: Noun, common
</li>
<li>xNP: Noun, proper
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Adjectives (xAJ)</h2>
<div class="outline-text-2" id="text-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Grade</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
<th scope="col" class="text-left">Species</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xAJ</td>
<td class="text-left">rP</td>
<td class="text-left">gMF</td>
<td class="text-left">nS</td>
<td class="text-left">cNAD</td>
<td class="text-left">sD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">rC</td>
<td class="text-left">gN</td>
<td class="text-left">nP</td>
<td class="text-left">cG</td>
<td class="text-left">sI</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">rS</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">rU</td>
<td class="text-left">gU</td>
<td class="text-left">nU</td>
<td class="text-left">cU</td>
<td class="text-left">sU</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Numerals (xNA and xNO)</h2>
<div class="outline-text-2" id="text-3">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
<th scope="col" class="text-left">Species</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xNO</td>
<td class="text-left">gMF</td>
<td class="text-left">nS</td>
<td class="text-left">cNAD</td>
<td class="text-left">sD</td>
</tr>

<tr>
<td class="text-left">xNA</td>
<td class="text-left">gN</td>
<td class="text-left">nP</td>
<td class="text-left">cG</td>
<td class="text-left">sI</td>
</tr>

<tr>
<td class="text-left">xNU</td>
<td class="text-left">gU</td>
<td class="text-left">nU</td>
<td class="text-left">cU</td>
<td class="text-left">sU</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Pronouns and Determiners (xPE, xPQ, xPI, xDD, xDQ, xDP)</h2>
<div class="outline-text-2" id="text-4">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Person</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xPE</td>
<td class="text-left">p1</td>
<td class="text-left">gM</td>
<td class="text-left">nS</td>
<td class="text-left">cN</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">p2</td>
<td class="text-left">gF</td>
<td class="text-left">nP</td>
<td class="text-left">cAD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">p3</td>
<td class="text-left">gN</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">cG</td>
</tr>
</tbody>
</table>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xPQ</td>
<td class="text-left">gM</td>
<td class="text-left">nS</td>
<td class="text-left">cN</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gF</td>
<td class="text-left">nP</td>
<td class="text-left">cAD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gN</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">cG</td>
</tr>
</tbody>
</table>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xPI</td>
<td class="text-left">gM</td>
<td class="text-left">nS</td>
<td class="text-left">cN</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gF</td>
<td class="text-left">nP</td>
<td class="text-left">cAD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gN</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">cG</td>
</tr>
</tbody>
</table>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xDD</td>
<td class="text-left">gM</td>
<td class="text-left">nS</td>
<td class="text-left">cN</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gF</td>
<td class="text-left">nP</td>
<td class="text-left">cAD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gN</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">cG</td>
</tr>
</tbody>
</table>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xDQ</td>
<td class="text-left">gM</td>
<td class="text-left">nS</td>
<td class="text-left">cN</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gF</td>
<td class="text-left">nP</td>
<td class="text-left">cAD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gN</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">cG</td>
</tr>
</tbody>
</table>

<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xDP</td>
<td class="text-left">gM</td>
<td class="text-left">nS</td>
<td class="text-left">cN</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gF</td>
<td class="text-left">nP</td>
<td class="text-left">cAD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gN</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">cG</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>xPE: Pronoun, personal
</li>
<li>xPQ: Pronoun, interrogative
</li>
<li>xPI: Pronoun, indefinite
</li>
<li>xDD: Determiner, demonstrative
</li>
<li>xDQ: Determiner, quantifier
</li>
<li>xDP: Determiner, possessive
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Articles (AT)</h2>
<div class="outline-text-2" id="text-5">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
<th scope="col" class="text-left">Species</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xAT</td>
<td class="text-left">gMF</td>
<td class="text-left">nS</td>
<td class="text-left">cNAD</td>
<td class="text-left">sD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gN</td>
<td class="text-left">nP</td>
<td class="text-left">cG</td>
<td class="text-left">sI</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">gU</td>
<td class="text-left">nU</td>
<td class="text-left">cU</td>
<td class="text-left">sU</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Verbs (xVB)</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> Finite (xVB fF)</h3>
<div class="outline-text-3" id="text-6-1">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Finiteness</th>
<th scope="col" class="text-left">Tense</th>
<th scope="col" class="text-left">Mood</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Voice</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xVB</td>
<td class="text-left">fF</td>
<td class="text-left">tPS</td>
<td class="text-left">mIN</td>
<td class="text-left">nS</td>
<td class="text-left">vA</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">tPT</td>
<td class="text-left">mSU</td>
<td class="text-left">nP</td>
<td class="text-left">vR</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">mIP</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">tU</td>
<td class="text-left">mU</td>
<td class="text-left">nU</td>
<td class="text-left">vU</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Participles (xVB fP)</h3>
<div class="outline-text-3" id="text-6-2">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Finiteness</th>
<th scope="col" class="text-left">Tense</th>
<th scope="col" class="text-left">Voice</th>
<th scope="col" class="text-left">Gender</th>
<th scope="col" class="text-left">Number</th>
<th scope="col" class="text-left">Case</th>
<th scope="col" class="text-left">Species</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xVB</td>
<td class="text-left">fP</td>
<td class="text-left">tPS</td>
<td class="text-left">vA</td>
<td class="text-left">gMF</td>
<td class="text-left">nS</td>
<td class="text-left">cNAD</td>
<td class="text-left">sD</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">tPT</td>
<td class="text-left">vR</td>
<td class="text-left">gN</td>
<td class="text-left">nP</td>
<td class="text-left">cG</td>
<td class="text-left">sI</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">tU</td>
<td class="text-left">vU</td>
<td class="text-left">gU</td>
<td class="text-left">nU</td>
<td class="text-left">cU</td>
<td class="text-left">sU</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> Infinitives (xVB fI)</h3>
<div class="outline-text-3" id="text-6-3">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Finiteness</th>
<th scope="col" class="text-left">Voice</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xVB</td>
<td class="text-left">fI</td>
<td class="text-left">vA</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">vR</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">&#xa0;</td>
<td class="text-left">vU</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Adverbs (xAV)</h2>
<div class="outline-text-2" id="text-7">
<table class="table table-striped table-bordered table-hover table-condensed">


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<thead>
<tr>
<th scope="col" class="text-left">Word class</th>
<th scope="col" class="text-left">Grade</th>
</tr>
</thead>
<tbody>
<tr>
<td class="text-left">xAV</td>
<td class="text-left">rP</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">rC</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">rS</td>
</tr>

<tr>
<td class="text-left">&#xa0;</td>
<td class="text-left">rU</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Uninflected categories</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>xAP: Preposition (we do not specify what the prepositions govern)
</li>
<li>xRP: Relative Particle
</li>
<li>xCC: Conjunction, coordinating
</li>
<li>xCS: Conjunction, subordinating
</li>
<li>xIM: Infinitive marker
</li>
<li>xIT: Interjection
</li>
<li>xUA: Unassigned
</li>
<li>xFW: Foreign word
</li>
</ul>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Nouns (xNC and xNP)</a></li>
<li><a href="#sec-2">2. Adjectives (xAJ)</a></li>
<li><a href="#sec-3">3. Numerals (xNA and xNO)</a></li>
<li><a href="#sec-4">4. Pronouns and Determiners (xPE, xPQ, xPI, xDD, xDQ, xDP)</a></li>
<li><a href="#sec-5">5. Articles (AT)</a></li>
<li><a href="#sec-6">6. Verbs (xVB)</a>
<ul class="nav">
<li><a href="#sec-6-1">6.1. Finite (xVB fF)</a></li>
<li><a href="#sec-6-2">6.2. Participles (xVB fP)</a></li>
<li><a href="#sec-6-3">6.3. Infinitives (xVB fI)</a></li>
</ul>
</li>
<li><a href="#sec-7">7. Adverbs (xAV)</a></li>
<li><a href="#sec-8">8. Uninflected categories</a></li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Forfatter: Sean Vrieland &amp; Alex Speed Kjeldsen</p>
<p class="date">Created: 2018-09-24 Mon 09:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 27.0.50 (<a href="http://orgmode.org">Org-mode</a> 9.1.14)</p>
</div>
</footer>
</body>
</html>
